VladimirGaristov/ROBKO_01-STM32/MCU_Firmware/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  *
  *	Solder bridge modifications on Nucleo-F767ZI:
  *	Remove SB13, SB118, SB132, SB133, SB160, SB164, SB173, SB178, R37, R38
  *	Solder SB144, SB145
  *
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f7xx_ll_adc.h"
#include "stm32f7xx_ll_dma.h"
#include "stm32f7xx_ll_rcc.h"
#include "stm32f7xx_ll_bus.h"
#include "stm32f7xx_ll_system.h"
#include "stm32f7xx_ll_exti.h"
#include "stm32f7xx_ll_cortex.h"
#include "stm32f7xx_ll_utils.h"
#include "stm32f7xx_ll_pwr.h"
#include "stm32f7xx_ll_usart.h"
#include "stm32f7xx.h"
#include "stm32f7xx_ll_gpio.h"

#if defined(USE_FULL_ASSERT)
#include "stm32_assert.h"
#endif /* USE_FULL_ASSERT */

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <stdlib.h>
#include <string.h>
/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */
// Lengths are defined here because cmd_buffer_t needs MAX_CMD_LEN
#define SERIAL_BUFFER_LEN 100
#define MAX_CMD_LEN 13
#define MAX_REPLY_LEN 13

// Stores pending commands, used to implement a linked list
typedef struct cmd_buffer_t
{
	struct cmd_buffer_t *next_cmd;
	uint8_t incomplete;
	uint8_t cmd_type;
	uint8_t cmd_data[MAX_CMD_LEN - 1];	// The one byte type field counts towards MAX_CMD_LEN
}
__attribute__((packed)) cmd_buffer_t;

typedef struct
{
	uint8_t motor;
	int16_t steps;
}
__attribute__((packed)) mov_cmd_t;

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

void _Error_Handler(char *, int);

void DWT_Init(void);
void DWT_Delay(uint32_t us);

void LED_wave(void);
void LED_Blink(void);
int32_t send_string(const char *msg);
int32_t receive_string(char *buffer, uint32_t buff_len);
void serial_test(void);
void motor_test(void);
int32_t set_addr(uint8_t addr);
int32_t step_motor(uint8_t motor, int8_t dir);
int32_t stop_motor(uint8_t motor);
void check_mode(void);
void manual_control(void);
int32_t remote_control(void);
void read_cmd(void);
void set_LEDs(void);
int8_t get_opto(void);
int8_t check_opto_flag(void);
int16_t max_steps_current_cmd(void);
int32_t calculate_ratio_to_max(float ratio[6], int16_t max);
static inline int heap_overflow(void *new_alloc, size_t size);
int send_reply(uint8_t *reply, uint8_t reply_len);
int32_t update_step_count(int16_t *counter, int8_t dir);
/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define CLAW_RELEASE_BUT_PIN LL_GPIO_PIN_13
#define CLAW_RELEASE_BUT_GPIO_PORT GPIOC
#define STEP_SIZE_PIN LL_GPIO_PIN_14
#define STEP_SIZE_GPIO_PORT GPIOC
#define MCO_PIN LL_GPIO_PIN_0
#define MCO_GPIO_PORT GPIOH
#define SHOULDER_POT_PIN LL_GPIO_PIN_0
#define SHOULDER_POT_GPIO_PORT GPIOC
#define LEFT_RIGHT_POT_PIN LL_GPIO_PIN_1
#define LEFT_RIGHT_POT_GPIO_PORT GPIOC
#define CLAW_ROTATION_POT_PIN LL_GPIO_PIN_2
#define CLAW_ROTATION_POT_GPIO_PORT GPIOC
#define ELBOW_POT_PIN LL_GPIO_PIN_3
#define ELBOW_POT_GPIO_PORT GPIOC
#define LED3_PIN LL_GPIO_PIN_0
#define LED3_GPIO_PORT GPIOA
#define LED4_PIN LL_GPIO_PIN_1
#define LED4_GPIO_PORT GPIOA
#define LED10_PIN LL_GPIO_PIN_2
#define LED10_GPIO_PORT GPIOA
#define LED11_PIN LL_GPIO_PIN_3
#define LED11_GPIO_PORT GPIOA
#define LED5_PIN LL_GPIO_PIN_4
#define LED5_GPIO_PORT GPIOA
#define LED6_PIN LL_GPIO_PIN_5
#define LED6_GPIO_PORT GPIOA
#define LED7_PIN LL_GPIO_PIN_6
#define LED7_GPIO_PORT GPIOA
#define LED8_PIN LL_GPIO_PIN_7
#define LED8_GPIO_PORT GPIOA
#define STEP_TIME_PIN LL_GPIO_PIN_4
#define STEP_TIME_GPIO_PORT GPIOC
#define LD1_PIN LL_GPIO_PIN_0
#define LD1_GPIO_PORT GPIOB
#define IOW_PIN LL_GPIO_PIN_1
#define IOW_GPIO_PORT GPIOB
#define IOR_PIN LL_GPIO_PIN_2
#define IOR_GPIO_PORT GPIOB
#define D3_PIN LL_GPIO_PIN_10
#define D3_GPIO_PORT GPIOB
#define D2_PIN LL_GPIO_PIN_11
#define D2_GPIO_PORT GPIOB
#define D4_PIN LL_GPIO_PIN_12
#define D4_GPIO_PORT GPIOB
#define D5_PIN LL_GPIO_PIN_13
#define D5_GPIO_PORT GPIOB
#define D6_PIN LL_GPIO_PIN_14
#define D6_GPIO_PORT GPIOB
#define D7_PIN LL_GPIO_PIN_15
#define D7_GPIO_PORT GPIOB
#define STLK_RX_PIN LL_GPIO_PIN_8
#define STLK_RX_GPIO_PORT GPIOD
#define STLK_TX_PIN LL_GPIO_PIN_9
#define STLK_TX_GPIO_PORT GPIOD
#define JOYSTICK_CONNECTED_PIN LL_GPIO_PIN_7
#define JOYSTICK_CONNECTED_GPIO_PORT GPIOC
#define MANUAL_MODE_PIN LL_GPIO_PIN_8
#define MANUAL_MODE_GPIO_PORT GPIOC
#define AUTO_MODE_PIN LL_GPIO_PIN_9
#define AUTO_MODE_GPIO_PORT GPIOC
#define LED9_PIN LL_GPIO_PIN_8
#define LED9_GPIO_PORT GPIOA
#define LED0_PIN LL_GPIO_PIN_13
#define LED0_GPIO_PORT GPIOA
#define LED1_PIN LL_GPIO_PIN_14
#define LED1_GPIO_PORT GPIOA
#define LED2_PIN LL_GPIO_PIN_15
#define LED2_GPIO_PORT GPIOA
#define CLAW_UP_BUT_PIN LL_GPIO_PIN_10
#define CLAW_UP_BUT_GPIO_PORT GPIOC
#define CLAW_DOWN_BUT_PIN LL_GPIO_PIN_11
#define CLAW_DOWN_BUT_GPIO_PORT GPIOC
#define CLAW_GRAB_BUT_PIN LL_GPIO_PIN_12
#define CLAW_GRAB_BUT_GPIO_PORT GPIOC
#define A0_PIN LL_GPIO_PIN_3
#define A0_GPIO_PORT GPIOB
#define A1_PIN LL_GPIO_PIN_4
#define A1_GPIO_PORT GPIOB
#define A2_PIN LL_GPIO_PIN_5
#define A2_GPIO_PORT GPIOB
#define ENABLE_PIN LL_GPIO_PIN_6
#define ENABLE_GPIO_PORT GPIOB
#define D1_PIN LL_GPIO_PIN_8
#define D1_GPIO_PORT GPIOB
#define D0_PIN LL_GPIO_PIN_9
#define D0_GPIO_PORT GPIOB
#ifndef NVIC_PRIORITYGROUP_0
#define NVIC_PRIORITYGROUP_0         ((uint32_t)0x00000007) /*!< 0 bit  for pre-emption priority,
                                                                 4 bits for subpriority */
#define NVIC_PRIORITYGROUP_1         ((uint32_t)0x00000006) /*!< 1 bit  for pre-emption priority,
                                                                 3 bits for subpriority */
#define NVIC_PRIORITYGROUP_2         ((uint32_t)0x00000005) /*!< 2 bits for pre-emption priority,
                                                                 2 bits for subpriority */
#define NVIC_PRIORITYGROUP_3         ((uint32_t)0x00000004) /*!< 3 bits for pre-emption priority,
                                                                 1 bit  for subpriority */
#define NVIC_PRIORITYGROUP_4         ((uint32_t)0x00000003) /*!< 4 bits for pre-emption priority,
                                                                 0 bit  for subpriority */
#endif
/* USER CODE BEGIN Private defines */
#define TEST_LED_PORT LD1_GPIO_PORT
#define TEST_LED_PIN LD1_PIN

// ADC timeout enable
#define USE_TIMEOUT 0

/* Delay between ADC end of calibration and ADC enable.                     */
/* Delay estimation in CPU cycles: Case of ADC enable done                  */
/* immediately after ADC calibration, ADC clock setting slow                */
/* (LL_ADC_CLOCK_ASYNC_DIV32). Use a higher delay if ratio                  */
/* (CPU clock / ADC clock) is above 32.                                     */
#define ADC_DELAY_CALIB_ENABLE_CPU_CYCLES  (LL_ADC_DELAY_CALIB_ENABLE_ADC_CYCLES * 32)

#define ADDR_DATA_PORT	GPIOB
#define INPUT_PORT		GPIOC
#define LED_PORT		GPIOA

//ADC thresholds
#define LEFT_THR		0x09CBU	//2.02V
#define RIGHT_THR		0x057BU	//1.13V
#define UP_THR			0x08F8U	//1.85V
#define DOWN_THR		0x0746U	//1.5V
#define LKG_CORRECTION	0x003EU	//0.05V	Subtract from threshold
#define POT_INIT_VAL	0x0800U

#define FULL_STEP		2
#define HALF_STEP		1
#define USE_LOCAL_STEP	0
#define USE_LOCAL_TIME	0
#define MAX_STEP_SPEED	5
#define FAST_STEP		7
#define SLOW_STEP		15
#define STEP_FWD		1
#define STEP_REV		-1
#define MOVE_UNTIL_DETECTION	1
#define MOVE_UNTIL_NO_DETECTION	2
#define MOVE_FREELY		0

//Stepper motors addresses and directions
#define ROTATION_MOTOR		0	//FWD=left
#define SHOULDER_MOTOR		1	//FWD=forward
#define ELBOW_MOTOR			2		//FWD=up
#define CLAW_GRAB_MOTOR		5	//FWD=open
#define CLAW_ROT_MOTOR_L	4	//FWD=up
#define CLAW_ROT_MOTOR_R	3	//FWD=down
#define ALL_MOTORS			6

#define LEFT_RIGHT_POT_NUM		1
#define SHOULDER_POT_NUM		0
#define ELBOW_POT_NUM			3
#define CLAW_ROTATION_POT_NUM	2

//Commands for remote control
#define MOV			1
#define MOVE		2
#define OFF			3
#define OPEN_FILE	4
#define GOTO_POS	5
#define GET_POS		6
#define KILL		7
#define CLEAR		8
#define FREEZE		9
#define RESUME		10
#define SAVE_POS	11
#define OPTO		12
#define SET_STEP	13
#define SET_SPEED	14
#define GET_STEP	15
#define GET_SPEED	16
#define SET_HOME	17

#define GET_POS_REPLY	18
#define SAVE_POS_REPLY	69
#define STEP_REPLY		20
#define SPEED_REPLY		21
#define ACK				22
#define ERROR_REPLY		23
#define LAST_CMD		24

#define REPEAT			25

#define FULL_RAM		101
#define UNKNOWN_CMD		102

//Enabling and disabling ROBKO 01
#define ENABLE_ROBKO() LL_GPIO_SetOutputPin(ADDR_DATA_PORT, ENABLE_PIN)
#define DISABLE_ROBKO() LL_GPIO_ResetOutputPin(ADDR_DATA_PORT, ENABLE_PIN)

// Heap limit
extern int _ebss;
extern int _estack;
#define HEAP_BASE &_ebss
#define STACK_BASE &_estack
#define HEAP_SIZE (HEAP_LIMIT - (uint32_t) HEAP_BASE)
#define STACK_SIZE 0x8000	// 32KB
#define HEAP_LIMIT ((uint32_t) STACK_BASE - STACK_SIZE)

static inline int heap_overflow(void *new_alloc, size_t size)
{
	if (new_alloc + size > (void *) HEAP_LIMIT)
	{
		return 1;
	}
	else
	{
		return 0;
	}
}
/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
